class QuestionModel {
  final int id;
  final String title, subtitle;

  QuestionModel(
      {required this.id,
        required this.title,
        required this.subtitle});
}

// list of products
List<QuestionModel> questionmodel = [
  QuestionModel(
    id: 1,
    title: "كيف أعرف بأني مسيطرة على السكر عند طفلي؟",
    subtitle: "هناك فحص الهيموجلوبين (السكر التراكمي) يجب أن تطلبي عمله من الطبيب لطفلك كل 3 أشهر فهو الذي يبين لك النتيجة النهاىية والمحصل النهائي لنسبة السكر عند طفلك خلال الشهور الثلاثة الماضية وإذا كانت السيطرة على السكر جيدة أو غير جيدة كما يلي 1: نسبة 7% أو أقل ممتاز 2- نسبة 8,9% جيد  3- نسبة 9،10 ضعيف 4- نسبة أكثر من 10%سيء",
  ),
  QuestionModel(
    id: 2,
    title: 'ماهو حمض الكيتون؟',
    subtitle: " يتكون حمض الكيتون في الجسم من حينما يكون هنالك كمية قليلة من الأنسولين في الدم. وعندما لا يستطيع الجسم استهلاك الجلوكوز في الدم لإنتاج الطاقة الحرارية وبدلا من ذلك يبدأ الجسم بتحليل الدهون والبروتينات حيث تؤدي هذه العملية إلى إنتاج أكماض الكيتونية وهي مركبات حمضية سرعان ما تبدأ في التراكم في الدم جاهلة إياه حمضيا، مما قد يؤدي إلى تكون الحماض الكيتوني السكري إذا لم يتم زيادة جرعة الإنسولين وكمية السوائل",
  ),
  QuestionModel(
    id: 3,
    title: 'هل جميع المصابون بداء السكري يكونون عرضة للمضاعفات مثل الفشل الكلوي والضعف الجنسي؟',
    subtitle: " لا، وهذا من رحمة الله ،ليس كل من لديه سكر سوف يصاب بالمضاعفات ولكن نسبة حدوث هذه المضاعفات يزيد بشكل سريع إذا كان السكر غير منتظم لذلك يجب عمل تحاليل الدم ومراجعة الطبيب الاستشاري بانتظام، كذلك يجب عند مراجعة الطبيب أن يكون دفتر التحاليل وجهاز تحليل السكر معك كتى يتسنى للطبيب تغيير الجرعات حسب القراءات المدونة",
  ),
  QuestionModel(
    id: 4,
    title: 'هل يمكن لمريض السكر أن ينمو طبيعيا ويدخل مرحلة البلوغ بصورة طبيعية؟',
    subtitle: " نعم خاصة إذا كانت نسبة السكر منتظمة ومعدل الخضاب السكري (السكر التراكمي) في المستوى المطلوب. كذلك يجب التأكد أن السكر لا يصاحبه أمراض أخرى مثل اضطرابات الغدة الدرقية ومرض حساسية الامعاء لمركبات القمح (الزلاقي البطيني) اللذان من شأنهما التأثير على النمو السليم وتأخر البلوغ",
  ),
  QuestionModel(
    id: 5,
    title: 'هل تأتي الدورة الشهرية بدورة طبيعية ومنتظمة للفتيات المصابات بداء السكر؟',
    subtitle: "نعم تأتي الدورة للفتاة المريضة بداء السكري كبقية الفتيات، ويجب الملاحظة أنه في بعض الأحيان نلاحظ ارتفاع نسبة السكر قبل بدء الدورة مباشرة نتيجة للتغيرات الهرمونية المصاحبة لها",
  ),
  QuestionModel(
    id: 6,
    title: 'هل المضاعفات المزمنة لمرضى داء السكري بسبب الأنسولين  أم بسبب زيادة نسبة السكر؟',
    subtitle: "بسبب زيادة السكر بل بالعكس إن الأنسولين المعطى يعادل نفس الأنسولين الذي يفرزه البنكرياس فلن يضر الجسم ، بل بإذن الله هو الشفاء",
  ),
  QuestionModel(
    id: 7,
    title: 'لقد مللت من التحاليل والأبر ماذا أفعل؟',
    subtitle: "في الفترة الحالية حجم الإبرة صغير جدا وإن شاء الله في الوقت القريب ممكن أن يظهر علاج الإنسولين عن طريق بخاخ أو عن طريق حبوب ولكن حاليا يجب علينا أن نصبر على قضاء الله وقدره. قال تعالى:(وبشر الصابرين)",
  ),
  QuestionModel(
    id: 8,
    title: "إذا وجدت اختلافا في طفلي أو تغيير مفاجئ مثلا بدأ ظهور جروح أو ضعف الإحساس في أطرافه ماذا أفعل؟ وكيف أمنع ذلك؟",
subtitle: 'ستمنعين ذلك بالعناية بقدم طفلك فلا تدعيه يلعب بالشارع مع أصحابه ونو حافي القدمين بل ألبسيه الشراب والحذاء الرياضي وإذا جرح اعتني بالجرح قبل أن يتطور وأن تفحصي قدميه دائما وأسفل القدمين وإذا وجدتي تغيرا أول خلل في نظره أو بالإحساس عند القدمين أو غير ذلك فأسرعي بأخذه إلى الطبيب لأن العلاج كلما كان سريعا عند بدء ظهور الأعراض كلما كانت فرصة الشفاء أفضل'

  ),
  QuestionModel(
    id: 9,
    title: 'ذا خرجت يوما مع طفلي إلى البحر كيف سآخذ الأنسولين؟',
    subtitle: 'في الحافظة الخاصة به، لأنها تحفظه في درجة الحرارة المناسبة.فالأنسولين إذا وضع في درجة حرارة عالية كالشمس مثلا او درجة حرارة منخفضة جدا كالفريزر فلن يعمل على الوجه المطلوب وفي كلتا الحالتين غير مناسب .اذا لم تتوفر الثلاجة فالأفضل وضعه في ترمس مليء بالثلج.'
  ),
  QuestionModel(
    id: 10,
    title: 'كيف أمنع حدوث الانتفاخ في مكان حقن الأنسولين؟',
    subtitle: 'بأن لا تحقنه في نفس المكان بل تغيره وهناك أكثر من موضع صالح لحقن الأنسولين فإن نتيجة حقن الأنسولين في مكان واحد يسبب انتفاخ في الطبقة الدهنية ومن ثم يسبب عدم امتصاص الإنسولين'
  ),
  QuestionModel(
    id: 11,
    title: 'كمية الدم غير كافية للقيام بتحاليل ماذا أفعل؟',
    subtitle: 'تدفئة يد الطفل أولا، ثم وخز الإبرة في المكان الصحيح(أعلى جانبي الإصبع)'
  ),
  QuestionModel(
    id: 12,
    title: 'كم عدد مرات تحاليل الدم؟',
    subtitle: 'يفضل 4 مرات في اليوم قبل الفطور وقبل الغذاء وقبل العشاء وعند النوم، ولكن إذا كان هنالك صعوبة فأقل عدد مرتين في اليوم على أن يكون في اليوم بالتناوب ففي اليوم الأول قبل الفطور وقبل العشاء وفي اليوم التالي قبل الغذاء وعند النوم'
  ),

];