class SaicoModel {
  final int id;
  final String title, subTitle,  image;

  SaicoModel(
      {required this.id,

        required this.title,
        required this.subTitle,

        required this.image});
}

// list of products
List<SaicoModel> saicoModel = [
  SaicoModel(
      id: 1,

      title: "كيفيه التعامل مع فكره رفض المرض",
      subTitle: "إجتمع بالناس الذين يقدمون الدعم المعنوي لك و تحدثوا سوية عن مرض السكر. حاول الحصول على أكثر قدر ممكن من المعلومات المتعلقة بالمرض و تقاسم معلومات المتعلقة بذلك مع أشخاص يعانون من مرض السكري، هذا الأمرض يساعد في تقبل المرض",
      image: "assets/images/saico1.png",

  ),
  SaicoModel(
      id: 2,

      title: "التخلص من الشعور بالذنب",
      subTitle: " لا يرجع تطور مرض السكري إلى سبب واحد بحد ذاته. إنه مرض أبعد من أن يحصل نتيجة خطأ المريض نفسه فقط، حتى ان بعض حالات مرض السكري لا يعرف سببها أصلا إذا ما قمت بتطبيق الأساليب الموضحة وحدك و لم تتخلص من الحالة التي تعاني منها او زادت فترة إنسجامك مع المرض او لحظت عدم نقصان حدة هذه الاحاسيس التي تعاني منها مع مرور الوقت، فإنه من المفيد في مثل هذه الحالة أن تتلقى و عائلتك مساعدة نفسية  قد يعاني كل مريض بمرض السكري من مشاكل نفسية. في الحقيقة إن تغيير العادات الغذائية و ممارسة النشاط الرياضي و إتباع عادات أكثر صحية في حياة الإنسان لا يقتصر فقط على حالات مرض السكري، إذا يجب على كل إنسان ممارسة حياة صحية و الإنتباه من أجل عدم مواجهة أية سلبيات في حياته. التغذية الصحية و السليمة تأتي دائما على رأس هذه الأمور",
      image: "assets/images/saico2.png",

  ),
  SaicoModel(
      id: 3,

      title: "تهدئة الغضب",
      subTitle: "ممارسة النشاط البدني و الروحي للمساعده في تأمين التوازن الداخلي للإنسان من جديد. يمكن للطفل العثور على نشاط مختلف قد يوجه عواطفه التعامل مع الإكتئاب، الخوف و القلق حدى أفضل الطرف للتخلص من الإكتئاب و الخوف و القلق تقاسم هذه المشاعر مع أفراد العائلة و الأصدقاء. تقاسم الأفكار و الأحاسيس بهذا الشكل و القيام بأداء التمارين الرياضية و المشاركة في التمارين الجماعية أو الدخول في أوساط مختلفة قد يساعد على الخروج من أثار مرض السكري النفسية",
      image: "assets/images/saico.png",

  ),

];